# INTRODUCTION TO PANDAS

------>> Pandas are basically similar to excel sheet but with programming and vsb and python features means all features of vsb but in python

In [1]:
import pandas as pd

In [2]:
data1 = pd.DataFrame()

In [3]:
data1

Empty DataFrame
Columns: []
Index: []

In [4]:
print(data1)

Empty DataFrame
Columns: []
Index: []

In [5]:
data2 = pd.DataFrame([[1,2,3,3],[45,66,432,55],[54,98,3,5,6]])

In [6]:
data2

    0   1    2   3    4
0   1   2    3   3  NaN
1  45  66  432  55  NaN
2  54  98    3   5  6.0

In [7]:
data2.head(2)

    0   1    2   3   4
0   1   2    3   3 NaN
1  45  66  432  55 NaN

In [8]:
data2.tail(2)

    0   1    2   3    4
1  45  66  432  55  NaN
2  54  98    3   5  6.0

In [9]:
data2.shape

(3, 5)

In [10]:
data2.iloc[1:3,0:2]

    0   1
1  45  66
2  54  98

In [11]:
data2.iloc[0:3,0:2]

    0   1
0   1   2
1  45  66
2  54  98

In [12]:
"TO NAME COLUMNS AND ROWS "

'TO NAME COLUMNS AND ROWS '

In [16]:
data2 = pd.DataFrame([[1,2,3,3],[45,66,432,55],[54,98,3,5,6]],columns=['C1','C2','C3','C4','C5'], index = ['R1','R2','R3'])

In [17]:
data2

    C1  C2   C3  C4   C5
R1   1   2    3   3  NaN
R2  45  66  432  55  NaN
R3  54  98    3   5  6.0